app/views/ideas/index.html.erb


					<% if i.users_liked.include? current_user%>
---
SELECT  1 AS one FROM "users" INNER JOIN "likes" ON "users"."id" = "likes"."user_id" WHERE "likes"."idea_id" = $1 AND "users"."id" = 2 LIMIT 1  [["idea_id", 1]]

						<% end %>
					 | This has <a href="/ideas/<%=i.id %>"><%= i.users_liked.count %> Likes</a></p>
---
SELECT COUNT(*) FROM "users" INNER JOIN "likes" ON "users"."id" = "likes"."user_id" WHERE "likes"."idea_id" = $1  [["idea_id", 1]]