app/views/ideas/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "likes" ON "users"."id" = "likes"."user_id" WHERE "likes"."idea_id" = $1  [["idea_id", 1]]
---
	<tbody>
		<% @idea.users_liked.uniq.each do |u| %> <tr>

SELECT COUNT(*) FROM "likes"  WHERE "likes"."user_id" = 3 AND "likes"."idea_id" = 1
---

				<td><%= Like.where(user: u, idea: @idea).count %></td>