app/views/users/show.html.erb

SELECT COUNT(*) FROM "ideas"  WHERE "ideas"."user_id" = $1  [["user_id", 1]]
---
	<p><label class="col-md-2 label-control">Number of ideas: </label>
	<%= @user.ideas.count %></p>

SELECT COUNT(*) FROM "likes"  WHERE "likes"."user_id" = $1  [["user_id", 1]]
---
	<p><label class="col-md-2 label-control">Number of ideas liked: </label>
		<%= @user.likes.count %></p>