app/controllers/ideas_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "ideas".* FROM "ideas"
---
  def index
  	@user = User.find(session[:user_id])
  	@ideas = Idea.all

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "ideas".* FROM "ideas"  WHERE "ideas"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
  	@user = User.find(session[:user_id])
  	@idea = Idea.find(params[:id])

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "ideas" ("content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "Hey its Geneva!"], ["created_at", "2015-12-17 19:05:42.640486"], ["updated_at", "2015-12-17 19:05:42.640486"], ["user_id", 1]]
---
  def create
  	@user = User.find(session[:user_id])
  	idea = @user.ideas.new(content: params[:content])
  	if idea.valid?
  		idea.save

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "ideas".* FROM "ideas"  WHERE "ideas"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "ideas" WHERE "ideas"."id" = 2
---
  def destroy
  	@user = User.find(session[:user_id])
  	@idea = Idea.find(params[:id])
  	@idea.delete if @idea.user == current_user