app/controllers/likes_controller.rb

  def create
  	user = User.find(session[:user_id])
  	Like.create(user: User.find(session[:user_id]), idea: Idea.find(params[:id]))
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "likes" ("created_at", "idea_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2015-12-17 19:41:25.353060"], ["idea_id", 1], ["updated_at", "2015-12-17 19:41:25.353060"], ["user_id", 2]]
SELECT  "ideas".* FROM "ideas"  WHERE "ideas"."id" = $1 LIMIT 1  [["id", 1]]

  def destroy
  	user = User.find(session[:user_id])
  	Like.find_by(idea: Idea.find(params[:id]), user: User.find(session[:user_id])).delete
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "likes" WHERE "likes"."id" = 1
SELECT  "ideas".* FROM "ideas"  WHERE "ideas"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "likes".* FROM "likes"  WHERE "likes"."idea_id" = 1 AND "likes"."user_id" = 2 LIMIT 1