app/controllers/users_controller.rb

  def create
    user = User.new(name: params[:name], alias: params[:alias], email: params[:email], password: params[:password], password_confirmation: params[:password_confirmation])
    if user.valid?
      user.save
---
INSERT INTO "users" ("alias", "created_at", "email", "name", "password_digest", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"